XBB/Xqiye/app/controllers/worker_messages_controller.rb

SELECT `worker_messages`.* FROM `worker_messages`
---
  def index
    @worker_messages = WorkerMessage.all

INSERT INTO `worker_messages` (`worker_id`, `worker_name`, `sex`, `age`, `birthday`, `role`, `academic`, `factory_id`, `region`, `delFlag`, `S_01`, `S_o2`, `created_at`, `updated_at`) VALUES ('0000001', '赵照', '男', 25, '2012-04-14 01:25:00', '取送人员', '大专', 2, '北京市海淀区', '', '', '', '2017-04-14 01:36:57', '2017-04-14 01:36:57')
---
  def create
    @worker_message = WorkerMessage.new(worker_message_params)

    respond_to do |format|
      if @worker_message.save

UPDATE `worker_messages` SET `sex` = '请选择', `academic` = '请选择', `updated_at` = '2017-04-14 12:24:29' WHERE `worker_messages`.`id` = 6
---
  def update
    respond_to do |format|
      if @worker_message.update(worker_message_params)

DELETE FROM `worker_messages` WHERE `worker_messages`.`id` = 2
---
  def destroy
    @worker_message.destroy

SELECT  `worker_messages`.* FROM `worker_messages` WHERE `worker_messages`.`id` = 2 LIMIT 1
---
    def set_worker_message
      @worker_message = WorkerMessage.find(params[:id])